package crypto

import "encoding/binary"

// ID ♏ | 作者 ⇨ 吴翔宇 | (｡･∀･)ﾉﾞ嗨
//
//	---------------------------------------------------------
//
// ID 节点的唯一身份标识。
type ID uint32

// ToBytes ♏ | 作者 ⇨ 吴翔宇 | (｡･∀･)ﾉﾞ嗨
//
//	---------------------------------------------------------
//
// ToBytes 返回ID的字节切片形式，以小端编码的方式将uint32编码到一个长度为4的字节切片中，
// 小端编码就是将高位字节放在高地址位，例如826这个数字，它的二进制表现形式如下所示：
//
//	00000000,00000000,00000011,00111010
//
// 对826进行小端编码，由于00000011是高位字节，将它放在高地址位，而00111010是低位字节，
// 将其放在低地址位，所以得到如下结果：
//
//	[2]byte{00111010, 00000011, 00000000, 00000000}:{58, 3, 0, 0}
func (id ID) ToBytes() []byte {
	var bz [4]byte
	binary.LittleEndian.PutUint32(bz[:], uint32(id))
	return bz[:]
}
